controllers/AbstractController.php

    public function init()
    {
        $this->session = Yii::$app->session;
        if (!$this->session->isActive) {
            $this->session->open();
        }

		if (!\Yii::$app->user->isGuest) {
			$this->user = User::find()->where(['id' => \Yii::$app->user->id])->one();
---
SELECT * FROM `user` WHERE `id`='1'