models/User.php

SELECT * FROM `user` WHERE `id`='1'
---
    public static function findIdentity($id)
    {
        $user = self::findOne($id);

SELECT * FROM `user` WHERE `email`='kasp89s@gmail.com'
---
    public static function findByUsername($email)
    {
		$user = User::find()->where(['email' => $email])->one();